package frameworks.common 
{
	/**
	 * ...
	 * @author yxh
	 */
	public class Source 
	{
		public static const PN_LIST:Array = ["生命教育","法制", "健康", "自然科学", "国学", "感恩", "道德伦理", "实践活动", "理想情操", "文明礼仪", "民族健康",
												  "环保教育", "意外伤害", "交通安全", "消防安全", "食品安全", "社会安全", "网络安全", "自然灾害", "其它安全", "心理教育"];
		
		public static const PID_LIST:Array = [1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22];
		
		public static const SUBJECT:Array = ["全部","生命教育","法制", "健康", "自然科学", "国学", "感恩", "道德伦理", "实践活动", "理想情操", "文明礼仪", "民族健康",
												  "环保教育", "意外伤害", "交通安全", "消防安全", "食品安全", "社会安全", "网络安全", "自然灾害", "其它安全", "心理教育"];
		
		public function Source() 
		{
			
		}
		
	}

}